In [1]:
import pandas as pd
import matplotlib.pyplot as plt

train = pd.read_csv('train.csv', header=0)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
male_df = train[train['Sex'] == 'male'][['Survived','Sex','Fare','Pclass']]
male_df.Survived.sum() / male_df.count()[0] * 100

18.890814558058924

In [3]:
female_df = train[train['Sex'] == 'female'][['Survived','Sex','Fare','Pclass']]
female_df.Survived.sum() / female_df.count()[0] * 100

74.203821656050948

In [4]:
female_df_1 = female_df[(female_df['Pclass'] == 3) & (female_df['Fare'] > 20)]
female_df_1.Survived.sum() / female_df_1.count()[0] * 100

24.324324324324326

In [5]:
female_df_2 = female_df[(female_df['Pclass'] == 3) & (female_df['Fare'] <= 20)]
female_df_2.Survived.sum() / female_df_2.count()[0] * 100

58.878504672897193

In [6]:
female_df_3 = female_df[(female_df['Pclass'] != 3)]
female_df_3.Survived.sum() / female_df_3.count()[0] * 100

94.705882352941174

In [7]:
test = pd.read_csv('test.csv', header=0)
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [8]:
test['Survived'] = 1
test.loc[(test['Sex'] == 'male'),'Survived'] = 0
test.loc[(test['Sex'] == 'female') & (test['Pclass'] == 3) & (test['Fare'] > 20),'Survived'] = 0
test = test.drop(['Pclass','Name','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked'],axis=1)
test.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [9]:
test.to_csv('genderclassmodel.csv', index=False)